Series

In [1]:
# dic() >>> Series()

In [2]:
import pandas as pd 

_dict = {'a':1,'b':2,'c':3}

pd.Series(_dict)

a    1
b    2
c    3
dtype: int64

In [3]:
d_s = pd.Series(_dict)
type(d_s)

pandas.core.series.Series

In [4]:
# list >>> Series
import pandas as pd 

_list = ['2022-05-26', 3.14, 'abc', 100, True]
pd.Series(_list)

0    2022-05-26
1          3.14
2           abc
3           100
4          True
dtype: object

In [6]:
ls = pd.Series(_list)

In [7]:
ls.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
ls.values

array(['2022-05-26', 3.14, 'abc', 100, True], dtype=object)

In [12]:
# Series 원소 선택 

import pandas as pd 

_tuple = ('멀티캠퍼스','2022-05-26','여', True)
ts = pd.Series(_tuple, index = ['이름', '생년월일','성별','학생여부'])
ts

이름           멀티캠퍼스
생년월일    2022-05-26
성별               여
학생여부          True
dtype: object

In [13]:
# 정수형 위치 인덱스
ts[0]

'멀티캠퍼스'

In [14]:
ts[-1]

True

In [17]:
ts[:3]

이름           멀티캠퍼스
생년월일    2022-05-26
성별               여
dtype: object

In [15]:
# 인덱스 이름으로 추출 
ts['이름']

'멀티캠퍼스'

In [16]:
ts['이름':'성별']

이름           멀티캠퍼스
생년월일    2022-05-26
성별               여
dtype: object

In [18]:
ts[[1,2]]

생년월일    2022-05-26
성별               여
dtype: object

In [19]:
ts[1:2]

생년월일    2022-05-26
dtype: object

DataFrame

In [20]:
import pandas as pd 

_dict = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [21]:
pd.DataFrame(_dict)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [22]:
df = pd.DataFrame(_dict)

In [23]:
type(df)

pandas.core.frame.DataFrame

In [28]:
import pandas as pd 

pd.DataFrame([[26,'남','양진욱','멀티캠퍼스'],[27,'남','소인록','멀티캠퍼스'], 
             [20,'남','신상연','서울대'],[21, '여','오보민','카이스트']],
              index = ['1번','2번','3번','4번'],
              columns =['나이','성별','이름','소속기관'])

    나이 성별   이름   소속기관
1번  26  남  양진욱  멀티캠퍼스
2번  27  남  소인록  멀티캠퍼스
3번  20  남  신상연    서울대
4번  21  여  오보민   카이스트

In [37]:
import pandas as pd 

df1 = pd.DataFrame([[26,'남','양진욱','멀티캠퍼스'],[27,'남','소인록','멀티캠퍼스'], 
             [20,'남','신상연','서울대'],[21, '여','오보민','카이스트']],
              index = ['1번','2번','3번','4번'],
              columns =['나이','성별','이름','소속기관'])

In [38]:
df1.index = ['20220101','20220102','20220103','20220104']

In [39]:
df1

          나이 성별   이름   소속기관
20220101  26  남  양진욱  멀티캠퍼스
20220102  27  남  소인록  멀티캠퍼스
20220103  20  남  신상연    서울대
20220104  21  여  오보민   카이스트

In [42]:
df.columns = ['age','gender','name','organization']

In [43]:
df

          age gender name organization
20220101   26      남  양진욱        멀티캠퍼스
20220102   27      남  소인록        멀티캠퍼스
20220103   20      남  신상연          서울대
20220104   21      여  오보민         카이스트

In [45]:
df2 = df.copy()
df2

          age gender name organization
20220101   26      남  양진욱        멀티캠퍼스
20220102   27      남  소인록        멀티캠퍼스
20220103   20      남  신상연          서울대
20220104   21      여  오보민         카이스트

In [28]:
import pandas as pd 

pd.DataFrame([[26,'남','양진욱','멀티캠퍼스'],[27,'남','소인록','멀티캠퍼스'], 
             [20,'남','신상연','서울대'],[21, '여','오보민','카이스트']],
              index = ['1번','2번','3번','4번'],
              columns =['나이','성별','이름','소속기관'])

    나이 성별   이름   소속기관
1번  26  남  양진욱  멀티캠퍼스
2번  27  남  소인록  멀티캠퍼스
3번  20  남  신상연    서울대
4번  21  여  오보민   카이스트

In [35]:
# 기존 index / columns
# index = ['1번','2번','3번','4번'],
# columns =['나이','성별','이름','소속기관'])

# 새로운 index / columns  

# df.index = ['20220101','20220102','20220103','20220104']
# df.columns = ['age','gender','name','organization']

In [52]:
df1.rename(index = {'1번':'20220101','2번':'20220102',
                    '3번':'20220103','4번':'20220104'},
             inplace=True)
df1

          age gender name organization
20220101   26      남  양진욱        멀티캠퍼스
20220102   27      남  소인록        멀티캠퍼스
20220103   20      남  신상연          서울대
20220104   21      여  오보민         카이스트

In [50]:
df1.rename(columns = {'나이':'age','성별':'gender',
                      '이름':'name','소속기관':'organization'},        
           inplace=True)

In [51]:
df1

          age gender name organization
20220101   26      남  양진욱        멀티캠퍼스
20220102   27      남  소인록        멀티캠퍼스
20220103   20      남  신상연          서울대
20220104   21      여  오보민         카이스트

In [53]:
import pandas as pd 

dat = {'수학': [90,80,70], '영어':[98,89,95],
      '음악':[85,95,100], '체육':[100,90,90]}

In [54]:
dat

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [126]:
pd.DataFrame(dat, index=['양진욱','최준섭','천승진'])

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [127]:
df = pd.DataFrame(dat, index=['양진욱','최준섭','천승진'])

In [128]:
df

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [57]:
df1 = df[:] # all
df1

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [58]:
df1.drop('최준섭', inplace=True)

C:\Users\student\AppData\Local\Temp\ipykernel_6864\2514502514.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.drop('최준섭', inplace=True)

In [59]:
df1

     수학  영어   음악   체육
양진욱  90  98   85  100
천승진  70  95  100   90

In [60]:
df2 = df[:]

In [61]:
df2.drop(['양진욱','천승진'], axis=0, inplace=True) # axis=0 행 방향

C:\Users\student\AppData\Local\Temp\ipykernel_6864\3842448836.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(['양진욱','천승진'], axis=0, inplace=True)

In [62]:
df2

     수학  영어  음악  체육
최준섭  80  89  95  90

In [63]:
df

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [66]:
df3 = df[:]

In [67]:
df3.drop('수학', axis=1, inplace=True)

C:\Users\student\AppData\Local\Temp\ipykernel_6864\1130362902.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('수학', axis=1, inplace=True)

In [68]:
df3

     영어   음악   체육
양진욱  98   85  100
최준섭  89   95   90
천승진  95  100   90

In [69]:
df4 = df[:]

In [70]:
df4.drop(['영어','체육'], axis=1, inplace=True)
df4

C:\Users\student\AppData\Local\Temp\ipykernel_6864\1716568536.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop(['영어','체육'], axis=1, inplace=True)

     수학   음악
양진욱  90   85
최준섭  80   95
천승진  70  100

In [71]:
import pandas as pd 

df

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

- 행선택

In [73]:
df.loc['천승진']

수학     70
영어     95
음악    100
체육     90
Name: 천승진, dtype: int64

In [74]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 양진욱, dtype: int64

In [75]:
df.loc[['천승진','최준섭']]

     수학  영어   음악  체육
천승진  70  95  100  90
최준섭  80  89   95  90

In [76]:
df.iloc[[0,1]]

     수학  영어  음악   체육
양진욱  90  98  85  100
최준섭  80  89  95   90

In [78]:
df.iloc[0:2]

     수학  영어  음악   체육
양진욱  90  98  85  100
최준섭  80  89  95   90

- 열 선택

In [79]:
df

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [80]:
df['수학']

양진욱    90
최준섭    80
천승진    70
Name: 수학, dtype: int64

In [81]:
df[['영어','음악']]

     영어   음악
양진욱  98   85
최준섭  89   95
천승진  95  100

In [84]:
df.loc['양진욱']

수학     90
영어     98
음악     85
체육    100
Name: 양진욱, dtype: int64

In [85]:
df.loc[:,'수학']

양진욱    90
최준섭    80
천승진    70
Name: 수학, dtype: int64

In [88]:
df.iloc[:,0]

양진욱    90
최준섭    80
천승진    70
Name: 수학, dtype: int64

In [89]:
df.iloc[: :2]

     수학  영어   음악   체육
양진욱  90  98   85  100
천승진  70  95  100   90

In [91]:
df.iloc[0:3:2]

     수학  영어   음악   체육
양진욱  90  98   85  100
천승진  70  95  100   90

In [93]:
df.iloc[: :-1]

     수학  영어   음악   체육
천승진  70  95  100   90
최준섭  80  89   95   90
양진욱  90  98   85  100

In [94]:
df

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

원소 선택

In [95]:
import pandas as pd 

df

     수학  영어   음악   체육
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [129]:
df['이름'] = ['양진욱', '최준섭','천승진']

In [130]:
df

     수학  영어   음악   체육   이름
양진욱  90  98   85  100  양진욱
최준섭  80  89   95   90  최준섭
천승진  70  95  100   90  천승진

In [131]:
df.set_index('이름', inplace=True)

In [132]:
df

     수학  영어   음악   체육
이름
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [133]:
df.loc['최준섭','음악']

95

In [134]:
df.iloc[0,2]

85

In [135]:
df.loc['양진욱', ['영어','체육']]

영어     98
체육    100
Name: 양진욱, dtype: int64

In [136]:
df.iloc[1,[2,3]]

음악    95
체육    90
Name: 최준섭, dtype: int64

In [137]:
df.loc['최준섭','음악':'체육']

음악    95
체육    90
Name: 최준섭, dtype: int64

In [138]:
df.iloc[1,2:]

음악    95
체육    90
Name: 최준섭, dtype: int64

- 열 추가

In [139]:
df

     수학  영어   음악   체육
이름
양진욱  90  98   85  100
최준섭  80  89   95   90
천승진  70  95  100   90

In [140]:
df['국어'] = 90

In [141]:
df

     수학  영어   음악   체육  국어
이름
양진욱  90  98   85  100  90
최준섭  80  89   95   90  90
천승진  70  95  100   90  90

- 행 추가

In [142]:
df

     수학  영어   음악   체육  국어
이름
양진욱  90  98   85  100  90
최준섭  80  89   95   90  90
천승진  70  95  100   90  90

In [143]:
df.loc['오보민'] =[80,90,100,95,100]

In [144]:
df

     수학  영어   음악   체육   국어
이름
양진욱  90  98   85  100   90
최준섭  80  89   95   90   90
천승진  70  95  100   90   90
오보민  80  90  100   95  100

In [145]:
df.loc['오보민']

수학     80
영어     90
음악    100
체육     95
국어    100
Name: 오보민, dtype: int64

- 원소값 변경

In [146]:
df.loc['오보민']['수학'] = 90
df

     수학  영어   음악   체육   국어
이름
양진욱  90  98   85  100   90
최준섭  80  89   95   90   90
천승진  70  95  100   90   90
오보민  90  90  100   95  100

In [147]:
df.iloc[0][2] = 100

In [148]:
df

     수학  영어   음악   체육   국어
이름
양진욱  90  98  100  100   90
최준섭  80  89   95   90   90
천승진  70  95  100   90   90
오보민  90  90  100   95  100

In [149]:
df

     수학  영어   음악   체육   국어
이름
양진욱  90  98  100  100   90
최준섭  80  89   95   90   90
천승진  70  95  100   90   90
오보민  90  90  100   95  100

In [150]:
df.transpose()

이름  양진욱  최준섭  천승진  오보민
수학   90   80   70   90
영어   98   89   95   90
음악  100   95  100  100
체육  100   90   90   95
국어   90   90   90  100

In [152]:
df.T

이름  양진욱  최준섭  천승진  오보민
수학   90   80   70   90
영어   98   89   95   90
음악  100   95  100  100
체육  100   90   90   95
국어   90   90   90  100

인덱스 활용

In [153]:
# set_index()

df

     수학  영어   음악   체육   국어
이름
양진욱  90  98  100  100   90
최준섭  80  89   95   90   90
천승진  70  95  100   90   90
오보민  90  90  100   95  100

In [155]:
ndf = df[:]
ndf

     수학  영어   음악   체육   국어
이름
양진욱  90  98  100  100   90
최준섭  80  89   95   90   90
천승진  70  95  100   90   90
오보민  90  90  100   95  100

In [157]:
ndf.set_index('국어')

     수학  영어   음악   체육
국어
90   90  98  100  100
90   80  89   95   90
90   70  95  100   90
100  90  90  100   95

In [159]:
ndf.set_index(['수학','음악'])

        영어   체육   국어
수학 음악
90 100  98  100   90
80 95   89   90   90
70 100  95   90   90
90 100  90   95  100

In [160]:
# 행 인덱스 재배열 

import pandas as pd 

_dat = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [161]:
_dat

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [162]:
pd.DataFrame(_dat, index = ['r0', 'r1','r2'])

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [163]:
df = pd.DataFrame(_dat, index = ['r0', 'r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [164]:
n_index = ['r0','r1','r2','r3','r4']

In [165]:
ndf = df.reindex(n_index)

In [166]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [167]:
ndf = df.reindex(n_index, fill_value=0)

In [168]:
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

- 행 인덱스 초기화

In [169]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [170]:
df.reset_index()

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [172]:
df.sort_index() # ascending=True(default)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [173]:
df.sort_index(ascending=False) # index가 내림차순 정렬

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [174]:
# sort_values()

df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [176]:
df.sort_values(by='c3', ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

산술연산

In [178]:
# Series 연산 

import pandas as pd 


stu_1 = pd.Series({'국어':100, '영어':80, '수학':90})
stu_1

국어    100
영어     80
수학     90
dtype: int64

In [190]:
percent = (stu_1 / 200) * 100

In [191]:
print(percent)

국어    50.0
영어    40.0
수학    45.0
dtype: float64

- Series 사칙연산

In [192]:
stu_1

국어    100
영어     80
수학     90
dtype: int64

In [194]:
stu_2 = pd.Series({'수학':100, '국어': 80, '영어':90})
stu_2

수학    100
국어     80
영어     90
dtype: int64

In [195]:
add = stu_1 + stu_2
sub = stu_1 - stu_2
mul = stu_1 * stu_2
div = stu_1 / stu_2

In [196]:
add, sub, mul, div

(국어    180
 수학    190
 영어    170
 dtype: int64,
 국어    20
 수학   -10
 영어   -10
 dtype: int64,
 국어    8000
 수학    9000
 영어    7200
 dtype: int64,
 국어    1.250000
 수학    0.900000
 영어    0.888889
 dtype: float64)

In [198]:
pd.DataFrame([add, sub, mul, div],
            index = ['합치기','빼기','곱하기','나누기'])

          국어      수학           영어
합치기   180.00   190.0   170.000000
빼기     20.00   -10.0   -10.000000
곱하기  8000.00  9000.0  7200.000000
나누기     1.25     0.9     0.888889

In [199]:
import numpy as np

stu_3 = pd.Series({'수학':np.nan, '국어': 80, '영어':np.nan})
stu_3

수학     NaN
국어    80.0
영어     NaN
dtype: float64

In [200]:
add = stu_1 + stu_3
sub = stu_1 - stu_3
mul = stu_1 * stu_3
div = stu_1 / stu_3

In [201]:
pd.DataFrame([add, sub, mul, div],
            index = ['합치기','빼기','곱하기','나누기'])

          국어  수학  영어
합치기   180.00 NaN NaN
빼기     20.00 NaN NaN
곱하기  8000.00 NaN NaN
나누기     1.25 NaN NaN

In [202]:
add = stu_1.add(stu_3, fill_value = 0)
sub = stu_1.sub(stu_3, fill_value = 0)
mul = stu_1.mul(stu_3, fill_value = 0)
div = stu_1.div(stu_3, fill_value = 0)

In [203]:
pd.DataFrame([add, sub, mul, div],
            index = ['합치기','빼기','곱하기','나누기'])

          국어    수학    영어
합치기   180.00  90.0  80.0
빼기     20.00  90.0  80.0
곱하기  8000.00   0.0   0.0
나누기     1.25   inf   inf

데이터프레임의 연산

In [204]:
import pandas as pd 
import seaborn as sns

In [205]:
titanic = sns.load_dataset('titanic')

In [206]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [207]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [208]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [209]:
titanic.loc[:, ['age','fare']]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [210]:
df = titanic.loc[:, ['age','fare']]

In [211]:
df + 10

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [212]:
# 데이터프레임 + 데이터프레임 

df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [213]:
add = df + 10
sub = add - df

In [216]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [215]:
add.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [217]:
sub.head()

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0